Revit 2027 API
BuiltInFailures.FamilyFailures.CannotSetFamilyTypeToNone Property
 Cannot set Family Type to 'None';.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotSetFamilyTypeToNone { get; }
Public Shared ReadOnly Property CannotSetFamilyTypeToNone As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotSetFamilyTypeToNone {
	FailureDefinitionId^ get ();
}
static member CannotSetFamilyTypeToNone : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace